import {
  Aside,
  Main,
  BottomEmptyBox,
  TopEmptyBox,
} from './style';
import React from 'react';
import { useSelector } from 'react-redux';
import CameraHeader from '../../components/CameraHeader';

const Home = () => {
  const isAsideVisible = useSelector((state) => state.visibility.isAsideVisible);
  return (
    <>
        <Aside>
          <TopEmptyBox/>
          친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다.
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>

          <p>
            야
          </p>
          <p>
            야
          </p>

          <p>
            야
          </p>

          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야아ㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏ

          </p>
          <button onClick={() => {
            console.log("버튼 확인");
          }}>aaassaasasa</button>
          <BottomEmptyBox>
          </BottomEmptyBox>
        </Aside>
        <Main style={{ left: isAsideVisible ? '0' : '300px' }}>
          <CameraHeader></CameraHeader>
          <TopEmptyBox/>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>

          <p>
            야
          </p>
          <p>
            야
          </p>

          <p>
            야
          </p>

          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야아ㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏ

          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>

          <p>
            야
          </p>
          <p>
            야
          </p>

          <p>
            야
          </p>

          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야아ㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏ

          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>

          <p>
            야
          </p>
          <p>
            야
          </p>

          <p>
            야
          </p>

          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야
          </p>
          <p>
            야아ㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏ

          </p>
          <BottomEmptyBox>
          </BottomEmptyBox>
        </Main>
    </>
  );
}

export default Home;