import React, { useState } from 'react';
import {
  Aside,
  Main,
  BottomEmptyBox,
} from './style';

//library
import { Link } from 'react-router-dom';

const Home = () => {
  const [isAsideVisible, setIsAsideVisible] = useState(true);

  function toggleAsideVisibility() {
    setIsAsideVisible(!isAsideVisible);
  }

  return (
    <>
      <Aside>
        친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다.친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다..친구는 세월의 도둑이다.
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>

        <p>
          야
        </p>
        <p>
          야
        </p>

        <p>
          야
        </p>

        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야아ㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏ

        </p>
        <button onClick={() => {
          console.log("버튼 확인");
        }}>aaassaasasa</button>
        <BottomEmptyBox>
        </BottomEmptyBox>
      </Aside>
      <Main style={{ left: isAsideVisible ? '300px' : '0' }}>
        <div onClick={toggleAsideVisibility}>눌러</div>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>

        <p>
          야
        </p>
        <p>
          야
        </p>

        <p>
          야
        </p>

        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야아ㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏ

        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>

        <p>
          야
        </p>
        <p>
          야
        </p>

        <p>
          야
        </p>

        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야아ㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏ

        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>

        <p>
          야
        </p>
        <p>
          야
        </p>

        <p>
          야
        </p>

        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야
        </p>
        <p>
          야아ㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏ

        </p>
        <BottomEmptyBox>
        </BottomEmptyBox>
      </Main>
    </>
  );
}

export default Home;